{
    "Cotton": {
        "Care": "Plowing at a depth of about 35 cm is recommended before planting. It helps to incorporate remaining plants into the soil, which improves soil texture. Weeds should be checked regularly, and after harvesting the field should be immediately plowed again to ensure an empty field for sowing in the next spring. A good sowing depth is 4-5 cm for seeds. About 25 kg of cotton seeds per hectare are recommended, with the average application of about 200 kg of a balanced fertilizer per hectare. In the sowing line, an average distance of 7.5 cm between seeds should be kept. Placing 1-2 healthy beehives per 1 hectare of cotton is beneficial. In areas with little rainfall, cotton fields should be irrigated before sowing and after blooming until boll splitting.",
        "Climate": "The cotton plant needs a long frost-free period, a lot of heat and plenty of sunshine for optimal growth. A warm and humid climate with moderate rainfall from 60cm to 120 cm is preferred. Only a few cotton seeds will germinate, if the soil temperature is below 15°C. During active growth, the ideal air temperature is 21-37°C. The average cotton plant can survive in temperatures up to 43°C  for short periods without great damage. Frequent rainfalls during the maturing stage (summer) and during the days of harvest (autumn) reduce yield in  cotton cultivation.",
        "Crop_Cycle_Length_Max": "215",
        "Crop_Cycle_Length_Min": "180",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Cultivated cotton is a perennial shrub of the Malvaceae family. Plants are 1â2 m high in modern-annual cropping systems, sometimes higher in traditional, multi-annual cropping systems. It is cultivated in subtropical regions of America, Africa, Australia, and India with consistently high temperatures, moderate rainfall and plenty of sun is provided.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "COTTON",
        "Id": "5a69adb890254844b20c2a52",
        "Importance": "1",
        "Introduction": "The cotton plant is a shrub of the Malvaceae family, native to the tropical and subtropical regions of America, Australia, Africa, and India. It is widely cultivated in over 90 countries for both its fiber and oilseed crop. The greatest diversity of wild cotton species can be found in Mexico, Australia, and Africa.",
        "K_From": "50",
        "K_Opt": "60",
        "K_To": "70",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "135",
        "N_Opt": "150",
        "N_To": "165",
        "N_Unit": "kg/ha",
        "Name": "Cotton",
        "P_From": "50",
        "P_Opt": "52",
        "P_To": "55",
        "P_Unit": "kg/ha",
        "Ph_From": "5.8",
        "Ph_Opt": "6.5",
        "Ph_To": "8",
        "Picture": "direct_seeding-cotton-1.jpg",
        "Plant_Height_From": "100",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "200",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "600",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1200",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Gossypium",
        "Seed_Depth_From": "4",
        "Seed_Depth_To": "5",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "400",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "800",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Cotton can grow in almost all soils, provided they are well-drained. However, for achieving high yields, sandy loam soils with enough clay, organic matter, and a moderate concentration of nitrogen and phosphorus are ideal. A gentle slope can be helpful as it promotes water drainage in a controlled direction. A soil pH between 5.8 and 8 is required for good cotton growth, 6 to 6.5 being the optimum range.",
        "Soil_Type": "loamy",
        "Spacing_From": "7",
        "Spacing_Opt": "0",
        "Spacing_To": "8.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "37",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "21",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "43",
        "Temp_Soil_Germ_From": "16",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "18",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Mango": {
        "Care": "If possible, cultivate mango plants from the mother-tree of your desired cultivar. When transplanting from nursery, it is important to keep as much of the root system in tact. Light but frequent irrigation is advised. High quantities of organic manure has also been found to be more beneficial for mango growth than chemical fertilizers. Plant training is important to give the mango a desirable shape. Regular pruning should be carried about, especially in the first 3-4 years of growth. Annual pruning, however, is not necessary due to the natural dome-shaped growth of the tree. Utmost care should be taken when harvesting fruits to avoid injury.",
        "Climate": "Mango grows well in most tropical and sub-tropical regions but is highly sensitive both severe heat and frost. Varied rain distribution across the cropping stages is crucial for a successful harvest. For example, dry weather is good for pollination during flowering, while rainy weather helps with fruit development. High wind can be damaging to mango trees.",
        "Crop_Cycle_Length_Max": "365",
        "Crop_Cycle_Length_Min": "1",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Fruit is yellow and fibrous with a large pit in the middle. Mango trees are evergreen with spreading branches and a dome shape. They can grow up to 10m, while the roots can grow up to 8m. Trees can start bearing fruits after 3-5 years. During these first few years, intercropping pulses and vegetables can make more productive use of the land.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "MANGO",
        "Id": "5cf79d2d3bd1b65e77a9b2cd",
        "Importance": "1",
        "Introduction": "The mango fruit is of high economic importance and is popular with consumers due to its good taste and wide range of varieties. It is nutritionally rich in vitamin A and C.  The wood of the mango tree can also be used for timber and religious purposes. Leaves can be fed to cattle as fodder.",
        "K_From": "1",
        "K_Opt": "1",
        "K_To": "1",
        "K_Unit": "kg/10 trees",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "2",
        "N_Opt": "2",
        "N_To": "2",
        "N_Unit": "kg/10 trees",
        "Name": "Mango",
        "P_From": "1",
        "P_Opt": "1",
        "P_To": "1",
        "P_Unit": "kg/10 trees",
        "Ph_From": "5.5",
        "Ph_Opt": "0",
        "Ph_To": "7.5",
        "Picture": "transplanted-mango-1583330725.jpg",
        "Plant_Height_From": "1000",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "4000",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "25",
        "Rainfall_Opt": "0",
        "Rainfall_To": "250",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Mangifera indica",
        "Seed_Depth_From": "0",
        "Seed_Depth_To": "0",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Mango can grow successfully on wide range of soils, with red loamy soil being optimal. Soils should have a good capacity for water retention, but poorly-drained soils will limit growth. Deep (greater than 1.2m), alluvial soils with organic matter will facilitate the best growth. For these reasons, cultivation in plains rather than on hills is preferred.",
        "Soil_Type": "loamy",
        "Spacing_From": "700",
        "Spacing_Opt": "0",
        "Spacing_To": "1100.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "22",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "27",
        "Temp_Soil_Germ_From": "0",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "0",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Onion": {
        "Care": "During cultivation, place mulch coverings around and between the plants to discourage weeds and to hold moisture in. Keep the soil moist so that shallow roots can take up water. Apply nitrogen fertilizers every few weeks to increase bulb size, and stop fertilization when onions start to push the soil away, and the bulbing process has begun.  At harvest, the roots should be clipped and the tops should be cut back up to 3 cm. The bulbs should be allowed to dry for several weeks before being stored in a storage area. Store at 5 to 10°C in a nylon bag.  In addition, do not store onions alongside with apples or pears.",
        "Climate": "Onion is a temperate crop but can be grown under a wide range of climatic conditions such as temperate, tropical and subtropical climate. The best performance can be obtained in a mild weather without the extremes of cold and heat and excessive rainfall, however, onion can withstand freezing temperatures. It requires about 70% relative humidity for good growth. It can grow well in places where the average annual rainfall is 650-750 mm with good distribution during the monsoon period. Onion crops need lower temperature and shorter day light (photoperiod) for vegetative growth while during the bulb development and maturity stage it needs a higher temperature and longer day light.",
        "Crop_Cycle_Length_Max": "150",
        "Crop_Cycle_Length_Min": "80",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "The onion has narrow, hollow leaves and a base which enlarges to form a bulb. It is a bulbous plant with the bulbs being produced annually. The leaves are semi-cylindrical or tubular in structure. They have a waxy coating on the surface and emerge from a subterranean bulb that bears short, branched roots. Flowers appear at the tip of the stem and are greenish-white in color. The bulb has several layers of overlapping surfaces around a central core and it can expand up to 10 cm in diameter. The bulb can be white, yellow, or red and requires 80 to 150 days to reach harvest.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "ONION",
        "Id": "5cf7c1f03bd1b662883b19d5",
        "Importance": "1",
        "Introduction": "The onion is a hardy cool-season biennial but usually grown as an annual crop. They come in a variety of shapes, sizes, and colors. Farmers will generally grow onions from seeds and transplant the seedlings. Onion sets are mainly used for seed production. Depending on the duration of the variety grown and climatic conditions, farmers can cultivate 3 cycles of onion per year.",
        "K_From": "40",
        "K_Opt": "40",
        "K_To": "40",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "110",
        "N_Opt": "110",
        "N_To": "110",
        "N_Unit": "kg/ha",
        "Name": "Onion",
        "P_From": "40",
        "P_Opt": "40",
        "P_To": "40",
        "P_Unit": "kg/ha",
        "Ph_From": "6",
        "Ph_Opt": "6.8",
        "Ph_To": "7.5",
        "Picture": "transplanted-onion-1583318551.jpg",
        "Plant_Height_From": "75",
        "Plant_Height_Opt": "100",
        "Plant_Height_To": "150",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "650",
        "Rainfall_Opt": "700",
        "Rainfall_To": "750",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Allium cepa",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "3",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "The best soil for successful onion cultivation is deep, friable loam and alluvial soils with good drainage, moisture-holding capacity and sufficient organic matter. The optimum pH range, regardless of soil type, is 6.0 - 7.5, but onions can also be grown in mild alkaline soils. They require abundant sun and drainage. The onion plants grow well in raised beds or rows of mounded soils that are at least 10 cm high.",
        "Soil_Type": "loamy",
        "Spacing_From": "9",
        "Spacing_Opt": "10",
        "Spacing_To": "11.0",
        "Storage": "",
        "Temp_Air_Germ_From": "20",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "25",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "13",
        "Temp_Day_Growth_Opt": "18",
        "Temp_Day_Growth_To": "24",
        "Temp_Soil_Germ_From": "2",
        "Temp_Soil_Germ_Opt": "24",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Sugarcane": {
        "Care": "Removing unwanted bottom dry and green leaves (detrashing) at regular intervals is an important practice because only the top eight to ten leaves are required for optimum photosynthesis. Detrashing should be taken up after the cane formation around 150 days after planting and done at a bi-monthly interval after that. Once planted, sugarcane can be harvested multiple times. After each harvest, the cane will produce new stalks. Yields decrease with each harvest and thus is replanted after a while. In commercial settings, this is done after 2 to 3 harvests. Harvest is done by hand or mechanically.",
        "Climate": "Sugarcane is adapted to a tropical or subtropical climate growing between the latitude 36.7° north and 31.0° south of the equator. The ideal temperature for the sprouting of stem cuttings is 32° to 38°C.  A total rainfall between 1100 and 1500 mm is ideal since it requires plenty of water for a continuous period of more than 6 to 7 months. High humidity (80-85%) favours rapid cane elongation during the grand growth period.",
        "Crop_Cycle_Length_Max": "550",
        "Crop_Cycle_Length_Min": "300",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Sugarcane is a long duration crop which is usually harvested 2-3 times before being replanted. It produces tall-growing lateral stems that can reach 2-8m high and 5 cm in diameter.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "SUGARCANE",
        "Id": "5ce7edad3bd1b6747f5d51d8",
        "Importance": "1",
        "Introduction": "Sugarcane is a cash crop used to produce over 75 per cent of the world&s;s sugar, but it is also used as fodder for livestock. Sugarcane is a tropical perennial grass native to Asia. It produces tall-growing lateral stems which turn into thick stalks or canes, from which sugar is made. Brazil and India are the largest producers of sugarcane in the world.",
        "K_From": "200",
        "K_Opt": "200",
        "K_To": "200",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "500",
        "N_Opt": "500",
        "N_To": "500",
        "N_Unit": "kg/ha",
        "Name": "Sugarcane",
        "P_From": "200",
        "P_Opt": "200",
        "P_To": "200",
        "P_Unit": "kg/ha",
        "Ph_From": "5",
        "Ph_Opt": "6.5",
        "Ph_To": "8.5",
        "Picture": "transplanted-sugarcane-1560501082.jpg",
        "Plant_Height_From": "100",
        "Plant_Height_Opt": "300",
        "Plant_Height_To": "500",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "5",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "1100",
        "Rainfall_Opt": "1300",
        "Rainfall_To": "1500",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Saccharum officinarum",
        "Seed_Depth_From": "15",
        "Seed_Depth_To": "25",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "25000",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "30000",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Sugarcane can be grown on many soils ranging although a well-drained, deep, loamy soil is ideal. A soil pH between 5 and 8.5 is required for sugarcane growth, 6.5 being the optimum range.",
        "Soil_Type": "loamy",
        "Spacing_From": "80",
        "Spacing_Opt": "0",
        "Spacing_To": "90.0",
        "Storage": "",
        "Temp_Air_Germ_From": "32",
        "Temp_Air_Germ_Opt": "35",
        "Temp_Air_Germ_To": "38",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "25",
        "Temp_Day_Growth_Opt": "32",
        "Temp_Day_Growth_To": "38",
        "Temp_Soil_Germ_From": "28",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "30",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "high"
    },
    "Maize": {
        "Care": "Thin your plants when they are approximately 8 to 10 cm tall, so they are 20 to 30 cm apart. Take care to not damage the roots when weeding. Make sure the soil is well drained and able to keep a consistent level of moisture. In dry conditions it is necessary to water the plants to ensure the shallow roots are kept moist.",
        "Climate": "One reason why maize is grown all over the world is its ability to grow in a wide range of agro-climatic conditions. However, moderate temperatures and rainfall are most favorable for the crop.",
        "Crop_Cycle_Length_Max": "110",
        "Crop_Cycle_Length_Min": "70",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Maize appears as a leafy stalk that usually grows 3 m high. One plant can grow several ears, also known as cobs, with multiple rows of kernels. One ear usually holds about 600 kernels, which vary in color depending on the variety.",
        "Exposition": "half shade",
        "Fertilization": "intermediate",
        "Host_Id": "MAIZE",
        "Id": "5a7ab9dc90254843a0d8bee7",
        "Importance": "1",
        "Introduction": "Maize, also known as corn, is a cereal grain from the Poaceae family. It was domesticated in southern Mexico approximately 10,000 years ago and has spread over the rest of the world in the last 500 years due to its ability to grow under various climatic conditions. Maize counts as a staple crop and plays an important role as food, feed, and fuel.",
        "K_From": "40",
        "K_Opt": "50",
        "K_To": "60",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "80",
        "N_Opt": "100",
        "N_To": "120",
        "N_Unit": "kg/ha",
        "Name": "Maize",
        "P_From": "40",
        "P_Opt": "50",
        "P_To": "60",
        "P_Unit": "kg/ha",
        "Ph_From": "5",
        "Ph_Opt": "6",
        "Ph_To": "7",
        "Picture": "direct_seeding-maize-1583328118.jpg",
        "Plant_Height_From": "150",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "300",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "500",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1000",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Zea mays",
        "Seed_Depth_From": "4",
        "Seed_Depth_To": "6",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "8",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "50",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Zea mays grows best on well drained and fertile loamy or alluvial soils. However, it is possible to grow maize on a wide variety of soils ranging from sand to clay. The crop is tolerant to soil acidity, neutralizing soil acidity through liming can increase yields.",
        "Soil_Type": "loamy",
        "Spacing_From": "10",
        "Spacing_Opt": "0",
        "Spacing_To": "15.0",
        "Storage": "",
        "Temp_Air_Germ_From": "28",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "41",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "10",
        "Temp_Day_Growth_Opt": "25",
        "Temp_Day_Growth_To": "38",
        "Temp_Soil_Germ_From": "16",
        "Temp_Soil_Germ_Opt": "17",
        "Temp_Soil_Germ_To": "30",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Tomato": {
        "Care": "Regular and reasonable irrigation during development and fruiting stage will help to avoid physiological problems such as blossom end rot. Especially during the fruiting stage the plants need a high amount of water. However, avoid prolonged leaf moisture as this favors fungal growth. Placing stakes in the soil at the time of planting will later on help to keep the developing tomato fruit off the ground. In greenhouses it is also possible to use strings or special cages.",
        "Climate": "Tomato is a warm-season crop that is self-pollinated. Tomatoes are frost-tender plants that thrive in warm weather, and therefore must be planted after the last spring frost has passed. In regions having less than 3½ months frost-free period the tomato is not likely to be profitable. Full sun exposure is important and the plants should get at least 6 hours of sunlight. The optimal temperature for germination is between 21 and 27°C. Temperature below 10°C and above 35°C lead to very poor germination. Although they can be planted any time after this date, tomatoes grow best when day temperatures are above 16°C and nighttime temperatures do not fall below 12 °C. Greenhouse ventilation/heating systems can be used in areas not fulfilling these needs.",
        "Crop_Cycle_Length_Max": "130",
        "Crop_Cycle_Length_Min": "90",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "The tomato belongs to the Solanaceae family and can grow in a wide range of climates. The plants are fairly easy to grow but are susceptible to pests and diseases. Temperature and light intensity affect the fruit-set,color and nutritive value of the fruit.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "TOMATO",
        "Id": "5b192157902548300f823079",
        "Importance": "1",
        "Introduction": "The tomato is a plant of the nightshade family (Solanaceae). It is fairly easy to grow and will produce a good crop in optimal settings. However, tomato plants are susceptible to pests and diseases. In relatively cold regions tomatoes can only be grown during the warmest months of the year (one crop), while in warm regions they can be grown the whole year round (two crops).",
        "K_From": "45",
        "K_Opt": "50",
        "K_To": "55",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "105",
        "N_Opt": "120",
        "N_To": "135",
        "N_Unit": "kg/ha",
        "Name": "Tomato Transplanted",
        "P_From": "55",
        "P_Opt": "60",
        "P_To": "65",
        "P_Unit": "kg/ha",
        "Ph_From": "6",
        "Ph_Opt": "6.8",
        "Ph_To": "7",
        "Picture": "transplanted-tomato-1.jpg",
        "Plant_Height_From": "40",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "70",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "30",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "40",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "400",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1500",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Solanum lycopersicum",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "2",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "70",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "100",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "The growth of tomato plants is adapted to well-drained, loamy soils, with a slightly acidic pH between 6 and 6.8. Root zones should be kept moist, but not soggy. Tomato roots may grow 3 meters deep in optimal conditions, therefore, it is important that the soil is loose and water can run freely. Hard pans and heavy clay soils may restrict growth in the root zone and cause unhealthy plants that have stunted growth and reduced yields.",
        "Soil_Type": "loamy",
        "Spacing_From": "60",
        "Spacing_Opt": "0",
        "Spacing_To": "90.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "21",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "27",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "16",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "35",
        "Temp_Soil_Germ_From": "10",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Grape": {
        "Care": "Selecting the variety of the grape is crucial depending on what you will use your grapes for. Once you have selected your variety plant your grapevines as early as possible to give the plant time to establish in preparation for the winter season. Soak your vine 3-4 hours before planting. Plant vines with the lowest bud on the cane just above the soil surface. Irrigate grapevines initially after planting and continue to irrigate weekly in order to keep the soil moist. Additionally, grapevines will require some sort of structural support in the growing phase in order to grow up and not along the ground.",
        "Climate": "Grapes are best grown in climates with a mild winter and a long, warm growing period. Grapes require around 710 mm of rain each year. Too much or too little rain can be detrimental to successful fruit production. Mediterranean regions are very successful in their grape production due to the relatively stable growing season that consists of warm and dry temperatures. Grapevines require a temperature of at least 10 degrees Celsius or 50 degrees Fahrenheit to begin physiological processes. The temperature, rainfall, and other climatic factors during production will have an impact on the flavour profile of the grapes. This is seen especially in the wine industry where the regional climatic difference has an effect on the taste of the final product. Furthermore, certain grape varieties are more suited for specific regions and climatic zones.",
        "Crop_Cycle_Length_Max": "364",
        "Crop_Cycle_Length_Min": "180",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Grapevines are a woody plant species which can grow up to 32 m in length. They belong to the family Vitaceae and are farmed for their fruits which are botanically classified as a berry. Their native range stretches around the Mediterranean region, central Europe, and southwestern Asia, however, grapes have been spread and are produced worldwide. There are thousands of varieties of wild grapes but only a few are used for crop production.  Grapes can be green, red, or purple.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "GRAPE",
        "Id": "5cf7b2853bd1b662883b1990",
        "Importance": "1",
        "Introduction": "A grape is a fruit that grows on the woody plant species of the genus Vitis. There are many varieties of grapes in the world and they can be eaten or used to make many various products including wine, jelly, jam, juice, vinegar, raisins, grape seed oil, and grape seed extract. Grapes have been cultivated by humans for thousands of years and are now grown and enjoyed all over the world.",
        "K_From": "7",
        "K_Opt": "7",
        "K_To": "7",
        "K_Unit": "kg/10 trees",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "8",
        "N_Opt": "8",
        "N_To": "8",
        "N_Unit": "kg/10 trees",
        "Name": "Grape",
        "P_From": "8",
        "P_Opt": "8",
        "P_To": "8",
        "P_Unit": "kg/10 trees",
        "Ph_From": "6.5",
        "Ph_Opt": "7",
        "Ph_To": "7.5",
        "Picture": "transplanted-grape-1583329152.jpg",
        "Plant_Height_From": "120",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "300",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "180",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "300",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "50",
        "Rainfall_Opt": "0",
        "Rainfall_To": "60",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Vitis vinifera",
        "Seed_Depth_From": "60",
        "Seed_Depth_To": "90",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Grapes can tolerate a wide variety of soil types but the most ideal soil type is sandy loam. Grapes require moderate soil nutrient content. Addition of nitrogen and potassium to the soils before the growing season can be beneficial in soils with lower nutrient content.  Grapes do best in slightly acidic conditions with a pH level ranging from 5.5-7.0. Well-drained soil conditions are also important in root production and to prevent crop disease.",
        "Soil_Type": "loamy",
        "Spacing_From": "200",
        "Spacing_Opt": "0",
        "Spacing_To": "300.0",
        "Storage": "",
        "Temp_Air_Germ_From": "21",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "21",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "15",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "40",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "40",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Papaya": {
        "Care": "Papaya is grown from seed in raised nursery beds, pots, or polythene bags. Seedlings can be transplanted to the field after 6-8 weeks. Drip irrigation is preferred for papaya cultivation so as to avoid water-logged soils. Papaya plants can be protected against frost by covering with polythene bags with air holes. Papaya is most sensitive to the development of the following diseases: powdery mildew, anthracnose, damping-off, and stem rot.",
        "Climate": "Papaya cultivation is suitable in tropical and sub-tropical regions at altitudes up to 600m above sea level. Warm weather favors the development of the crop. High humidity is desired for growth, while drier conditions are favorable for ripening. Strong winds are detrimental to the crop due to their shallow roots.",
        "Crop_Cycle_Length_Max": "304",
        "Crop_Cycle_Length_Min": "182",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Papaya plants can grow up to 10 meters tall. They grow in an unbranched fashion unless they are damaged at the stem. The leaves are fan-like in shape, and male and female flowers are shaped differently. Papaya fruits are large and oblong, and green in color when unripe, turning orange as they ripen.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "PAPAYA",
        "Id": "5cf7b86c3bd1b65e77a9b2f4",
        "Importance": "1",
        "Introduction": "Papaya is an important tropical fruit that is high in nutrients such as vitamin C. It is also valued for its medicinal properties. Its by-products are also used in the manufacturing, pharmaceutical, and textile industries.",
        "K_From": "2",
        "K_Opt": "2",
        "K_To": "2",
        "K_Unit": "kg/10 trees",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "2",
        "N_Opt": "2",
        "N_To": "2",
        "N_Unit": "kg/10 trees",
        "Name": "Papaya",
        "P_From": "2",
        "P_Opt": "2",
        "P_To": "2",
        "P_Unit": "kg/10 trees",
        "Ph_From": "5.5",
        "Ph_Opt": "6.5",
        "Ph_To": "7.5",
        "Picture": "transplanted-papaya-1583329646.jpg",
        "Plant_Height_From": "0",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "0",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "0",
        "Rainfall_Opt": "83",
        "Rainfall_To": "0",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Carica papaya",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "1",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Loamy, sandy soil with a pH between 5.5 and 7.5 is best for papaya cultivation. Alluvial soil along waterways offers an alternative environment for growth. Despite their shallow roots, papaya trees need deep soil that drains well. Papaya should be planted in areas that are protected from the wind, or windbreaks should be planted on the perimeter of the land.",
        "Soil_Type": "loamy",
        "Spacing_From": "1500",
        "Spacing_Opt": "0",
        "Spacing_To": "1800.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "25",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "35",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "20",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Bean": {
        "Care": "Bean germinates within 3-4 days. It starts flowering after 45 days. Weeding should be given at 20-25 days and 40-45 days after sowing. The crop should be earthed up after each weeding. Pole-type cultivars grow well on a support made of cane frames or wooden poles connected with strings.",
        "Climate": "The ideal temperature range for the proper growth of this crop is 10-27°C. Above 30 °C, the flower drop is a serious problem, and below 5 °C the developing pods and branches can be damaged.",
        "Crop_Cycle_Length_Max": "60",
        "Crop_Cycle_Length_Min": "40",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Types of bean include the dwarf type and pole type. The pole type is a climbing plant and needs some support to climb, either bamboo or wooden sticks. The dwarf type is bushy and needs no support.",
        "Exposition": "full sun",
        "Fertilization": "low",
        "Host_Id": "BEAN",
        "Id": "5a7ab98890254844b20c2c9d",
        "Importance": "1",
        "Introduction": "Bean (french bean, green bean) is one of the most popular and widely grown vegetables in India. The green immature pods can be cooked and eaten as a vegetable. Immature pods are for to be sold as fresh, frozen or canned. It is also an important pulse crop, with high yielding ability as compared to gram and pea.",
        "K_From": "25",
        "K_Opt": "25",
        "K_To": "25",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "50",
        "N_Opt": "50",
        "N_To": "50",
        "N_Unit": "kg/ha",
        "Name": "Bean",
        "P_From": "50",
        "P_Opt": "50",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "5.7",
        "Ph_To": "6",
        "Picture": "direct_seeding-bean-1583330820.jpg",
        "Plant_Height_From": "60",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "300",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "30",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "50",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "350",
        "Rainfall_Opt": "0",
        "Rainfall_To": "500",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Phaseolus vulgaris",
        "Seed_Depth_From": "2",
        "Seed_Depth_To": "4",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "50",
        "Seed_Rate_Opt": "52",
        "Seed_Rate_To": "55",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "A good seedbed has friable but compact soil with adequate moisture and free from weeds and plant debris. Acidic soils must be treated with lime before sowing. For field preparation, soil should be ploughed 2-3 times with a power tiller or with a spade. Planking is done during the last ploughing to make friable soil bed for sowing.",
        "Soil_Type": "loamy",
        "Spacing_From": "15",
        "Spacing_Opt": "22",
        "Spacing_To": "30.0",
        "Storage": "",
        "Temp_Air_Germ_From": "18",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "29",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "22",
        "Temp_Day_Growth_To": "27",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "26",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Wheat": {
        "Care": "Keep an eye out for weeds and regularly water the crops if growing in a dry climate. Growing cycles vary widely between different varieties. Growing winter wheat will take a lot more time than growing spring wheat varieties.",
        "Climate": "Wheat grows best in cool and moist climate, while for ripening a warm and dry climate is ideal. Therefore, regions with cool winters and hot summers are optimal for growing Triticum aestivum. Direct sunshine is beneficial for the crop.",
        "Crop_Cycle_Length_Max": "180",
        "Crop_Cycle_Length_Min": "90",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Wheat has an erect stem with linear leaves growing on either side of the stem. The stem ends in a spike that contains the seeds. Depending on the variety, the crop can be planted in different times of the year.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "WHEAT",
        "Id": "5a7aba6f90254844b20c2c9f",
        "Importance": "1",
        "Introduction": "Wheat is a grass of the Poaceae family and a worldwide known staple crop. It was cultivated for its seed, a cereal grain, approximately 10,000 years ago. Wheat is the most traded food crop and base for many diets as it is high in carbohydrates, protein and fiber.",
        "K_From": "35",
        "K_Opt": "40",
        "K_To": "45",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "115",
        "N_Opt": "120",
        "N_To": "125",
        "N_Unit": "kg/ha",
        "Name": "Wheat",
        "P_From": "55",
        "P_Opt": "60",
        "P_To": "65",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6",
        "Ph_To": "6.5",
        "Picture": "direct_seeding-wheat-1583329416.jpg",
        "Plant_Height_From": "60",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "120",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "300",
        "Rainfall_Opt": "700",
        "Rainfall_To": "1500",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Triticum aestivum",
        "Seed_Depth_From": "2",
        "Seed_Depth_To": "5",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "100",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "150",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "The most suitable soil for Triticum aestivum is either light clay or heavy loam. Heavier clay and sandy loam can also be used, however, this will usually reduce yields. Adequate drainage needs to be provided and soil pH should be only slightly acidic.",
        "Soil_Type": "loamy",
        "Spacing_From": "5",
        "Spacing_Opt": "5",
        "Spacing_To": "10.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "0",
        "Temp_Day_Growth_Opt": "16",
        "Temp_Day_Growth_To": "35",
        "Temp_Soil_Germ_From": "4",
        "Temp_Soil_Germ_Opt": "22",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Gram": {
        "Care": "Mature beans are ready for harvest after 80 to 100 days. The crop has a intermediate water demand, irrigation intervals of 7 to 10 days are recommended. Fields should be constantly monitored for signs of drought.",
        "Climate": "Vigna mungo can be found in tropical areas of Asia, Madagascar and Africa. The plant is primariliy distributed in lowlands but can be found up to 1800 m above sea level. It grows best during the dry seasons in temperatures ranging from 25°C to 35°C.",
        "Crop_Cycle_Length_Max": "100",
        "Crop_Cycle_Length_Min": "80",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Vigna mungo, also known as black gram, belongs to the leguminaceae family and is originated in India. By now it can be found in various tropical regions. It contains high levels of protein (25 g/100 g) and plays an important role as a staple crop.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "GRAM",
        "Id": "5a7abaf590254844b20c2ca1",
        "Importance": "1",
        "Introduction": "Black gram is an erect annual herb with hairy leaves and narrow seed pods of 4-6 cm length. The stem is branched and the plant has a bushy appearance. The plant is based on a well-developed taproot. India produces approximately 1.5 million tons of gram seeds per year, with other big producers being Myanmar and Thailand.",
        "K_From": "35",
        "K_Opt": "37",
        "K_To": "40",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "20",
        "N_Opt": "22",
        "N_To": "25",
        "N_Unit": "kg/ha",
        "Name": "Gram",
        "P_From": "40",
        "P_Opt": "45",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "4.5",
        "Ph_Opt": "6",
        "Ph_To": "7",
        "Picture": "direct_seeding-gram-1583329022.jpg",
        "Plant_Height_From": "30",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "100",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "600",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1000",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Vigna mungo",
        "Seed_Depth_From": "1.5",
        "Seed_Depth_To": "2",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "10",
        "Seed_Rate_Opt": "15",
        "Seed_Rate_To": "20",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Ideal soil types are rich black vertisols or loamy soils that are well-drained and have  a pH of 6-7. However, if lime and gypsum are added to the soil, Vigna mungo can withstand acidic soils down to a pH of 4.5. The crop is sensitive to saline and alkaline soils. It is drought-tolerant and grows best in semi-arid areas.",
        "Soil_Type": "loamy",
        "Spacing_From": "10",
        "Spacing_Opt": "20",
        "Spacing_To": "30.0",
        "Storage": "",
        "Temp_Air_Germ_From": "24",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "30",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "8",
        "Temp_Day_Growth_Opt": "30",
        "Temp_Day_Growth_To": "40",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Potato": {
        "Care": "Using healthy, disease-free seed tubers is of paramount importance for a successful potato crop. Weeds need to be removed by the time the canopy develops (within about 4 weeks after planting) in order for plants to grow well. Earthing up of the soil every 15-20 days helps to limit weed growth and also loosen soil. As potato has high nutrient requirements, green manure is recommended as one form of fertilization. Since potato has a shallow root system, irrigations should be light. After harvest, potatoes should be dried for 10-15 days in the shade so that curing of the skin occurs. Potato is ideal for intercropping, especially with sugarcane, fennel, onion, mustard, wheat, or linseed.",
        "Climate": "Potato is a temperate climate crop, however it grows under a diverse range of climatic conditions. It is grown only in places where the growing season&s;s temperature is moderately cool. The vegetative growth of the plant is best at a temperature of 24°C while tuber development is favoured at 20°C. Hence, potato is grown as a summer crop in the hills and as a winter crop in the tropical and subtropical regions. The crop can be raised up to an altitude of 3000 m above the sea level.",
        "Crop_Cycle_Length_Max": "120",
        "Crop_Cycle_Length_Min": "75",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Potato is a herbaceous perennial plant part of the Solanaceae family. It is a branched bushy plant, usually 0.5 to 1m in height possessing underground stems bearing the edible tubers. The tubers usually grow under the top 25 cm layer of soil. The flowers of potato plant range in colour but  white or purple are most common. The plant produces a small fruit in the shape of a green berry which is not eadible.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "POTATO",
        "Id": "5a7ab77b90254843a0d8bee5",
        "Importance": "1",
        "Introduction": "Potato is originally from the Andes in South America. Potato has been cultivated in India for the last 300 years and it has become one of the most popular crops there. Potatoes are grown for their edible tubers which are economical food as they provide a source of low-cost energy to humans. Potatoes have rich nutritional value as they are rich in starch, vitamins (especially C and B1), and minerals. Potatoes are also used for several industrial purposes such as for the production of starch and alcohol.",
        "K_From": "120",
        "K_Opt": "120",
        "K_To": "120",
        "K_Unit": "kg/ha",
        "Labor": "high",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "150",
        "N_Opt": "150",
        "N_To": "150",
        "N_Unit": "kg/ha",
        "Name": "Potato",
        "P_From": "60",
        "P_Opt": "60",
        "P_To": "60",
        "P_Unit": "kg/ha",
        "Ph_From": "5.2",
        "Ph_Opt": "5.8",
        "Ph_To": "6.4",
        "Picture": "direct_seeding-potato-1583331046.jpg",
        "Plant_Height_From": "50",
        "Plant_Height_Opt": "75",
        "Plant_Height_To": "100",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "500",
        "Rainfall_Opt": "600",
        "Rainfall_To": "700",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Solanum tuberosum",
        "Seed_Depth_From": "5",
        "Seed_Depth_To": "7",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "1360",
        "Seed_Rate_Opt": "1814",
        "Seed_Rate_To": "2268",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Potatoes can be grown almost on any type of soil except saline and alkaline soils. Soils that are naturally loose and offer the least resistance to tuber growth is preferred. Loamy and sandy loam soils, rich in organic matter and with good drainage and aeration are most suitable for cultivation of potato crop. Soils with pH range of 5.2-6.4 are considered to be ideal.",
        "Soil_Type": "loamy",
        "Spacing_From": "15",
        "Spacing_Opt": "17",
        "Spacing_To": "20.0",
        "Storage": "",
        "Temp_Air_Germ_From": "23",
        "Temp_Air_Germ_Opt": "24",
        "Temp_Air_Germ_To": "25",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "15",
        "Temp_Day_Growth_Opt": "18",
        "Temp_Day_Growth_To": "21",
        "Temp_Soil_Germ_From": "19",
        "Temp_Soil_Germ_Opt": "20",
        "Temp_Soil_Germ_To": "21",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Cucumber": {
        "Care": "Timely picking of cucumber is important for best quality fruit. Dig in plenty of well rotted organic matter such as compost before planting. Use supports such as trellis if you&s;re growing cucumbers upwards. Set plants at about 45cm apart. Cucumbers should be harvested while they are still small and tender.",
        "Climate": "This crop requires a moderate warm temperature, ideally between 20 and 26 C. Excess humidity promotes diseases like powdery mildew and downy mildew. Frost conditions are not suitable.",
        "Crop_Cycle_Length_Max": "70",
        "Crop_Cycle_Length_Min": "50",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Cucumber plants are climbing plants of large size. The plant is a sprawling vine with large leaves and curling tendrils. The plants have hairy triangular leaves and yellow flowers. The fruit of a cucumber plant has an elongate shape and is 15cm long. The skin has a green color and turns yellow at maturation. The stems are herbaceous  and are covered with hairs and each knot of the stem has a leaf and a tendril. The roots are scarcely branched and are long and thin.",
        "Exposition": "half shade",
        "Fertilization": "intermediate",
        "Host_Id": "CUCUMBER",
        "Id": "5a7aba1790254843a0d8bee9",
        "Importance": "1",
        "Introduction": "Cucumber is an annual plant of warm seasons. It is a climbing plant that is used as summer vegetable throughout in India. The cucumber fruit is eaten raw or is served as a salad or cooked as a vegetable. The seeds of cucumber are used for oil extraction which has health benefits.",
        "K_From": "50",
        "K_Opt": "50",
        "K_To": "50",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "150",
        "N_Opt": "150",
        "N_To": "150",
        "N_Unit": "kg/ha",
        "Name": "Cucumber",
        "P_From": "75",
        "P_Opt": "75",
        "P_To": "75",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6.5",
        "Ph_To": "7.5",
        "Picture": "direct_seeding-cucumber-1583330285.jpg",
        "Plant_Height_From": "0",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "0",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "0",
        "Rainfall_Opt": "0",
        "Rainfall_To": "0",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Cucumis sativus",
        "Seed_Depth_From": "2",
        "Seed_Depth_To": "3",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "2",
        "Seed_Rate_Opt": "2",
        "Seed_Rate_To": "3",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Sandy loam soil that is rich in organic matter, with good drainage, and a pH range from 6.5-7.5 are ideal for cucumber cultivation. Make sure the soil contains organic matter by adding organic compost or any farm yard manure for higher yield.",
        "Soil_Type": "loamy",
        "Spacing_From": "60",
        "Spacing_Opt": "75",
        "Spacing_To": "90.0",
        "Storage": "",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "20",
        "Temp_Air_Germ_To": "24",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "24",
        "Temp_Day_Growth_To": "26",
        "Temp_Soil_Germ_From": "20",
        "Temp_Soil_Germ_Opt": "25",
        "Temp_Soil_Germ_To": "25",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Banana": {
        "Care": "Bananas need a lot of warmth for optimum growth. If required, additional heat can be given by planting next to a building or asphalt/cement. As the species use a lot of water, regular deep watering is a necessity during warm weather. Plants should not dry out. On the other hand, standing water, especially in cool weather, will cause root rot. A thick layer of mulch conserves moisture. Banana plants are heavy feeders and should be treated with 0,5-2 pounds (depending on growth stage) of balanced fertilizer once per month about 4-8 feet from the trunk. Bananas are susceptible to wind damage and therefore require protection for best appearance and maximum yield. New shoots will develop around maturing banana plants. They should be pruned to give the main plant all the energy it needs during its growth. If plants are close to fruiting, shoots can be taken (when at least 3 feet tall) as seedlings for new cultivars. Seeds can also be used for planting.",
        "Climate": "The banana plant needs 10 - 15 months of frost-free conditions in temperatures of 15-35 °C to produce a flower stalk. Most varieties stop growing when the temperature drops below 53° F (11.5 °C). Towards higher temperatures, growth slows down at about 80° F (26,5 °C) and stops entirely when the temperature reaches 100° F (38 °C). High temperatures and bright sunlight might scorch leaves and fruit, although bananas grow best in full sun. Freezing temperatures will kill the foliage. Bananas are susceptible to being blown over by wind.",
        "Crop_Cycle_Length_Max": "456",
        "Crop_Cycle_Length_Min": "365",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Bananas are edible fruits belonging to the Musa genus. They are grown in any humid tropical region of the world and form the 4th largest fruit crop of the world. The varieties need 10-15 months of frost-free conditions, at least 60 cm deep and soil, preferably a continuous amount of high temperatures and a lot of water. They can be cultivated by using either seed or suckers pruned from mature banana plants. Plants are mature when leaf growth stops and instead a flower spike is starting to emerge at the top. After fruiting, the main stalk dies, but suckers will develop at the base of the stalk, which can be used for next generations.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "BANANA",
        "Id": "5a7084e790254844b20c2b98",
        "Importance": "1",
        "Introduction": "The banana is an edible fruit, produced by several kinds of large flowering plants in the genus Musa. Some bananas are used for cooking, others as dessert. Musa species are native to southeast Asia and Australia. Banana is basically a tropical crop, which prefers humid lowlands, but can be cultivated from sea level to an elevation of 2000 m.",
        "K_From": "3",
        "K_Opt": "3",
        "K_To": "3",
        "K_Unit": "kg/10 trees",
        "Labor": "high",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "2",
        "N_Opt": "2",
        "N_To": "2",
        "N_Unit": "kg/10 trees",
        "Name": "Banana",
        "P_From": "1",
        "P_Opt": "1",
        "P_To": "1",
        "P_Unit": "kg/10 trees",
        "Ph_From": "6",
        "Ph_Opt": "6.7",
        "Ph_To": "7.5",
        "Picture": "transplanted-banana-1583329548.jpg",
        "Plant_Height_From": "300",
        "Plant_Height_Opt": "500",
        "Plant_Height_To": "700",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "1600",
        "Rainfall_Opt": "1700",
        "Rainfall_To": "1800",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Musa",
        "Seed_Depth_From": "45",
        "Seed_Depth_To": "60",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Bananas will grow in most soils, but to thrive, they should be planted in a rich, deep, well-drained soil, which could be forest loam, rocky sand, marl, red laterite, volcanic ash, sandy clay, or even heavy clay. They prefer an acid soil with a pH between 5.5 and 6.5. The banana is not tolerant of salty soils. The key element in soil type for successful banana plant growth is good drainage. Washed up soils of river valleys are ideal for banana growing.",
        "Soil_Type": "loamy",
        "Spacing_From": "100",
        "Spacing_Opt": "150",
        "Spacing_To": "200.0",
        "Storage": "",
        "Temp_Air_Germ_From": "4",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "21",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "13",
        "Temp_Day_Growth_Opt": "27",
        "Temp_Day_Growth_To": "38",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "17",
        "Temp_Soil_Germ_To": "19",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "high"
    },
    "Sorghum": {
        "Care": "Fields should be ploughed before sowing to reduce weed and pest intensity. Soil tillage also increases the seed germination rate, improves the soil structure and prevents erosion. Sorghum is sensitive to frost so the sowing should happen after the last frost. Furthermore, the seeds need a certain degree of moisture to germinate. Drought events during planting can decrease the germination rate.",
        "Climate": "Sorghum grows best in warm regions with daytime temperatures around 27 to 30 °C. The crop can withstand drought in a dormant state if its roots are developed well enough and resume growth once the conditions are favorable again. In tropical and subtropical regions Sorghum can be grown in elevations up to 2300 m. Water requirements differ depending on the cultivar but are generally lower than for maize.",
        "Crop_Cycle_Length_Max": "105",
        "Crop_Cycle_Length_Min": "100",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Sorghum is a drought and flood resistant warm-weather crop and more tolerant than maize. Its roots can reach a depth of 2 m and a lateral distribution of 1 m. The leaves are protected by a thin waxy layer and can roll up in times of drought to minimize water loss through transpiration.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "SORGHUM",
        "Id": "5b97b28e9025484c682395b7",
        "Importance": "1",
        "Introduction": "The grass species Sorghum bicolor was originally cultivated in Africa and is now grown in tropical and subtropical regions around the world. Main uses of the grain are food, animal fodder, and biofuel production. Sorghum plays an important role as staple crop and is usually grown annualy, even though some perennial cultivars exist.",
        "K_From": "20",
        "K_Opt": "40",
        "K_To": "40",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "60",
        "N_Opt": "80",
        "N_To": "80",
        "N_Unit": "kg/ha",
        "Name": "Sorghum",
        "P_From": "30",
        "P_Opt": "40",
        "P_To": "40",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "0",
        "Ph_To": "8.5",
        "Picture": "direct_seeding-sorghum-1583329255.jpg",
        "Plant_Height_From": "0",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "0",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "250",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1000",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "plough",
        "Scientific_Name": "Sorghum bicolor",
        "Seed_Depth_From": "2.5",
        "Seed_Depth_To": "4",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "8",
        "Seed_Rate_Opt": "10",
        "Seed_Rate_To": "12",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "The robust staple crop Sorghum is mainly grown on shallow soils with high clay content but can also survive on more sandy soils. It can tolerate a wide range of pH levels and also thrives on alkaline soils. The plant can withstand waterlogging and drought to a certain degree but grows best on well drained soils.",
        "Soil_Type": "clay",
        "Spacing_From": "15",
        "Spacing_Opt": "20",
        "Spacing_To": "20.0",
        "Storage": "",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "40",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "18",
        "Temp_Day_Growth_Opt": "32",
        "Temp_Day_Growth_To": "40",
        "Temp_Soil_Germ_From": "26",
        "Temp_Soil_Germ_Opt": "15",
        "Temp_Soil_Germ_To": "30",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Soybean": {
        "Care": "When selecting a soybean strain, one has to consider that varieties differ in their suitability for certain growing seasons. The pest history of a field should be considered before soybean planting. Some varieties have a genetic resistance to the most important pests. Plant multiple soybean varieties to ensure diversity across fields. Soybeans are able to fix nitrogen through a symbiosis with the bacterium Bradyrhizobium japonicum. For best results, the correct strain of bacteria should be mixed with the soybean seed before planting. Soybean seeds should be planted at about 4 cm below the surface, approximately 40 cm apart from each other. Planting is recommended when soil temperatures are at least 10°C and trending upwards.",
        "Climate": "Soybeans are usually grown in cool, temperate regions like the midwestern United States and southern Canada, but tropical climates like Indonesia also give good results. This crop can grow almost anywhere with a warm growing season, ample water, and sunlight. Soybeans can be damaged by subfreezing temperatures, but they are less tender than several other crops, such as corn. Soybeans also need a growing season with temperatures between 20°C and 40°C and at least 500 mm of water. Day length plays an important role in soyabean crop production. Good yield is achieved where the length of day is less than 14 hours.",
        "Crop_Cycle_Length_Max": "120",
        "Crop_Cycle_Length_Min": "80",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Soybean is a fast growing annual crop, native to east Asia but currently grown worldwide. Optimal growth conditions are average day-temperatures around 30°C, 500 mm water during the growing season, and full sun exposure. Genetically modified soybeans are widespread in the main producing countries, and ocupy most of the growing areas.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "SOYBEAN",
        "Id": "5a71004890254843a0d8bda9",
        "Importance": "1",
        "Introduction": "Soybean (Glycine max) is a type of legume of the Fabaceae family native to east Asia. It is mainly known for its edible bean which provides good proteins and oil. The main countries growing soybeans are the United States (32% of world total), Brazil (31%) and Argentina (18%).",
        "K_From": "15",
        "K_Opt": "17",
        "K_To": "20",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "15",
        "N_Opt": "25",
        "N_To": "20",
        "N_Unit": "kg/ha",
        "Name": "Soybean",
        "P_From": "50",
        "P_Opt": "55",
        "P_To": "60",
        "P_Unit": "kg/ha",
        "Ph_From": "5.6",
        "Ph_Opt": "6.5",
        "Ph_To": "7",
        "Picture": "direct_seeding-soybean-1583330393.jpg",
        "Plant_Height_From": "51",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "127",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "500",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1200",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Glycine max",
        "Seed_Depth_From": "3",
        "Seed_Depth_To": "5",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "10",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "11",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Healthy, fertile, workable soil is beneficial for growing soybeans. Especially loamy soil works well due to its ability to keep the soil drained but still moist. Soybean plants prefer slightly acidic soils with a pH around 6.5. The crop can be grown from sea level up to an altitude of 2000 m.",
        "Soil_Type": "loamy",
        "Spacing_From": "30",
        "Spacing_Opt": "0",
        "Spacing_To": "45.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "30",
        "Temp_Day_Growth_To": "40",
        "Temp_Soil_Germ_From": "10",
        "Temp_Soil_Germ_Opt": "25",
        "Temp_Soil_Germ_To": "30",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Eggplant": {
        "Care": "Eggplants should be guided on rods or strings to allow an erect growth. Dead leaves should be removed and regular weeding is important since the crop requires a high amount of nutrients. The soil should be moist but not flooded. Fruit harvesting can be done approximately 110 to 170 days after sowing.",
        "Climate": "Solanum melongena grows in tropical to temperate climates. If grown in cooler temperatures it might be necessary to start the growth process in a greenhouse until the soil is warm enough for transplanting. In cold climates the crop is grown as annual, while warm climates allow a perennial growth. Direct sunlight is beneficial for the growth of the plant.",
        "Crop_Cycle_Length_Max": "170",
        "Crop_Cycle_Length_Min": "110",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "The plant has a spiny stem and flowers which range from a white to purple color. Its fruits are usually purple but can also range from white to black. They have an egg-like shape and are responsible for the English name &s;eggplant&s;.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "EGGPLANT",
        "Id": "5b92472a9025480e50e21210",
        "Importance": "1",
        "Introduction": "Eggplant, also known as aubergine, is a plant of the nightshade family (Solanaceae) and is primarily grown for its edible fruit. The crop originally has been cultivated in India and can now be found in warm climates all around the world.",
        "K_From": "50",
        "K_Opt": "60",
        "K_To": "55",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "105",
        "N_Opt": "120",
        "N_To": "135",
        "N_Unit": "kg/ha",
        "Name": "Eggplant",
        "P_From": "50",
        "P_Opt": "70",
        "P_To": "60",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6.5",
        "Ph_To": "7",
        "Picture": "transplanted-eggplant-1583330029.jpg",
        "Plant_Height_From": "40",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "120",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "600",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1200",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Solanum melongena",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "2",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Solanum melongena requires a rich and porous soil that is well drained but not dry. The soil should be only slightly acidic, a pH of 6.5 is ideal. The roots of the plant extend up to 50 cm into the soil, a barrier-free soil is therefore favorable.",
        "Soil_Type": "loamy",
        "Spacing_From": "15",
        "Spacing_Opt": "0",
        "Spacing_To": "20.0",
        "Storage": "",
        "Temp_Air_Germ_From": "20",
        "Temp_Air_Germ_Opt": "25",
        "Temp_Air_Germ_To": "30",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "30",
        "Temp_Soil_Germ_From": "10",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "40",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "high"
    },
    "Cabbage": {
        "Care": "The soil should be plowed deeply before planting with a minimum depth of 450-600 mm being achieved. Plowing will help incorporate any remaining soil matter into the soil and improve soil texture. Soil should be fumigated 2 weeks before planting to control for nematodes. Cabbage requires high amounts of nutrient to grow successfully with around 200-250 kg of Nitrogen added per hectare. Several applications of fertilizer can help in obtaining higher yields. Cabbage can be directly seeded or transplanted with seedlings. Roughly 2kg of seeds per hectare is required. Irrigation should occur immediately after sowing or planting and followed with an irrigation every 8 days in lighter soils until the desired size is achieved. Harvesting can be completed by hand by cutting the cabbage at the stalk when the cabbage is at a slightly immature stage. Storage should occur in a cool, humid environment.",
        "Climate": "Cabbage grows best in cool and humid climates. When exposed to higher heat, yields can be lower and it will become more difficult to control pests. The optimal temperature range for growth is between 18-20 °C. Cabbage is very resistant to cold weather and can survive in temperatures as low as -3°C without crop damage. Cabbage is highly adaptable and can be grown in many regions throughout the entire year. Water requirements vary from 380 to 500 mm per crop. Crop water usage increases during the growing season.",
        "Crop_Cycle_Length_Max": "120",
        "Crop_Cycle_Length_Min": "90",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Cabbage is a biennial crop but is commercially grown as an annual. It has a branching root system and an unbranched stem that remains under 30 cm long. Cabbage has been selectively bred to favor various colors, shapes, sizes, and other physical characteristics resulting in hundreds of varieties of the crop being produced.",
        "Exposition": "full sun",
        "Fertilization": "high",
        "Host_Id": "CABBAGE",
        "Id": "5cf7932f3bd1b6629754b7d8",
        "Importance": "1",
        "Introduction": "The cabbage plant is a cruciferous vegetable that is a member of the Brassicaceae family. Cabbage plants are widely grown due to their climatic adaptability and for their high nutritional value. Originating in Europe, cabbage plants are now cultivated and eaten around the world.",
        "K_From": "120",
        "K_Opt": "120",
        "K_To": "120",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "120",
        "N_Opt": "120",
        "N_To": "120",
        "N_Unit": "kg/ha",
        "Name": "Cabbage",
        "P_From": "100",
        "P_Opt": "100",
        "P_To": "100",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6",
        "Ph_To": "6.5",
        "Picture": "transplanted-cabbage-1562761526.jpg",
        "Plant_Height_From": "40",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "60",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "30",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "60",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "380",
        "Rainfall_Opt": "0",
        "Rainfall_To": "550",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "plough",
        "Scientific_Name": "Brassica oleracea",
        "Seed_Depth_From": "1.25",
        "Seed_Depth_To": "1",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "2",
        "Seed_Rate_Opt": "2",
        "Seed_Rate_To": "2",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Cabbage can grow in nearly any type of soil depending on the variety but thrives in well-drained, loamy soils. Under conditions with high rainfall, sandier soils are preferred due to higher drainage rates. Since cabbage is sensitive to highly acidic soils, the ideal pH range is 5.5 to 6.5. Cabbage requires a large number of nutrients, so soils with higher organic matter content are preferred.",
        "Soil_Type": "loamy",
        "Spacing_From": "50",
        "Spacing_Opt": "50",
        "Spacing_To": "60.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "7",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "29",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "18",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "20",
        "Temp_Soil_Germ_From": "7",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "23",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Millet": {
        "Care": "Pearl millet seeds should be planted at a shallow depth in a firm, moist seedbed. It is a deep-rooted crop that can use residual nutrients from the soil, requiring less fertilization than other grains. It also does not normally require substantial insecticide application. The grains can be harvested as early as 40 days after flowering, as indicated by the grains emerging from the head upon pinching. It can be harvested by hand or mechanically. It is imperative that the grains be properly dried prior to storage to avoid sprouting.",
        "Climate": "Pearl millet can be cultivated in areas with drought and high temperatures. It needs high daytime temperatures for the grain to mature. Despite its drought resistance, it requires evenly distributed rainfall throughout the season.",
        "Crop_Cycle_Length_Max": "105",
        "Crop_Cycle_Length_Min": "100",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Pearl millet is an annual crop that can grow up to 4 meters tall. The grains produced are the largest kernels of all millet varieties (except sorghum) at around 3 - 4 mm, and can range in color from whitish-yellow to brown-grey.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "MILLET",
        "Id": "5a7abbb990254844b20c2ca3",
        "Importance": "1",
        "Introduction": "Pennisetum glaucum (pearl millet) is the most widely-grown millet variety. It is known for its rich nutrient profile and its ability to withstand harsh weather conditions such as flooding and drought. The grains are used for human consumption while the rest of the crop is used as fodder.",
        "K_From": "45",
        "K_Opt": "45",
        "K_To": "45",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "90",
        "N_Opt": "90",
        "N_To": "90",
        "N_Unit": "kg/ha",
        "Name": "Millet",
        "P_From": "45",
        "P_Opt": "45",
        "P_To": "45",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "0",
        "Ph_To": "7.5",
        "Picture": "direct_seeding-millet-1583330128.jpg",
        "Plant_Height_From": "500",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "4000",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "250",
        "Rainfall_Opt": "0",
        "Rainfall_To": "700",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Pennisetum glaucum",
        "Seed_Depth_From": "3",
        "Seed_Depth_To": "4",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "8",
        "Seed_Rate_Opt": "10",
        "Seed_Rate_To": "12",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Pearl millet can grow in areas with low soil fertility, and high salinity or low pH, making it a good alternative to other crops. It can also tolerate acidic sub-soils that are high in aluminum content. However, it does not tolerate waterlogging or clay soils.",
        "Soil_Type": "loamy",
        "Spacing_From": "15",
        "Spacing_Opt": "20",
        "Spacing_To": "20.0",
        "Storage": "",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "40",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "26",
        "Temp_Day_Growth_Opt": "27",
        "Temp_Day_Growth_To": "29",
        "Temp_Soil_Germ_From": "23",
        "Temp_Soil_Germ_Opt": "25",
        "Temp_Soil_Germ_To": "30",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Okra": {
        "Care": "The land should be well-plowed and have had manure well-incorporated. Okra requires moderate quantities of water that should preferably be delivered through drip irrigation at regular intervals. Weed management is also crucial for okra cultivation as it has a long harvesting period which can be impacted by weed growth. Crop rotation can help to minimize the incidence of pests and diseases.",
        "Climate": "Okra is one of the most heat- and drought-tolerant vegetables in the world; once established, it can survive severe drought conditions. However, Okra grows best in warm and humid conditions, with a temperature range of 24-27°C.",
        "Crop_Cycle_Length_Max": "100",
        "Crop_Cycle_Length_Min": "80",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Okra is a member of the Malvaceae, thus related to cotton and hibiscus. It is a perennial plant often cultivated as an annual. It can reach up to 2 meters tall.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "OKRA",
        "Id": "5cf7c3683bd1b6629754b833",
        "Importance": "1",
        "Introduction": "Okra (Abelmoschus esculentus) also known as ladies&s; fingers is cultivated around the world throughout the tropical and warm temperate regions of the world. It is valued for its seed pods, edible when picked young. Dry fruit skin and fibres are used in manufacture of paper, card board and fibres. Root and stem are used for clearing cane juice for preparation of jaggery.",
        "K_From": "50",
        "K_Opt": "50",
        "K_To": "50",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "50",
        "N_Opt": "50",
        "N_To": "50",
        "N_Unit": "kg/ha",
        "Name": "Okra",
        "P_From": "50",
        "P_Opt": "50",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "5.8",
        "Ph_Opt": "6.4",
        "Ph_To": "6.8",
        "Picture": "direct_seeding-okra-1583330530.jpg",
        "Plant_Height_From": "100",
        "Plant_Height_Opt": "150",
        "Plant_Height_To": "200",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "0",
        "Rainfall_Opt": "1000",
        "Rainfall_To": "0",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Abelmoschus esculentus",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "2",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "3",
        "Seed_Rate_Opt": "4",
        "Seed_Rate_To": "5",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Okra can be grown in a wide range of soils. It grows best in loose, friable, well-drained sandy loam soils rich in organic matter. It can also produce good yields in heavy soils so long as there is good drainage. An optimum pH for this plant ranges from 6.0-6.8. Alkaline, saline soils and soils with poor drainage are not good for this crop.",
        "Soil_Type": "loamy",
        "Spacing_From": "30",
        "Spacing_Opt": "38",
        "Spacing_To": "45.0",
        "Storage": "",
        "Temp_Air_Germ_From": "16",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "40",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "25",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "30",
        "Temp_Soil_Germ_From": "21",
        "Temp_Soil_Germ_Opt": "24",
        "Temp_Soil_Germ_To": "27",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Citrus": {
        "Care": "Citrus love warm climates and special care has to be taken to protect them from cold temperatures or frost. Windbreaks are sometimes necessary to avoid fruit damage and its consequent degradation. Irrigation is essential for regular cropping in areas where rainfall is below 700 mm per year. Trees prefer less frequent, deep waterings to frequent, shallow sprinklings. Citrus trees are highly sensitive to salt, which makes the quality of the water essential for a good cropping.",
        "Climate": "The species are happiest in warm, temperate areas but have some degree of resistance to frost (variable between varieties). Citrus tolerate high temperatures provided the soil moisture is optimal. Trees have some resistance to cold temperatures but in general they are not recommended in areas with heavy regular frosts. Resistance to frosts varies with variety, tree age and health. Young tree will be damaged by even very light frosts whereas an acclimated mature tree may tolerate temperatures down to -5° C for a short time. Trees under stress are more sensitive.",
        "Crop_Cycle_Length_Max": "365",
        "Crop_Cycle_Length_Min": "1",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Citrus describes a genus of flowering trees and shrubs in the Rutaceae family of plants. Native to subtropical and tropical regions of south-East Asia, these bushes or trees are of small to moderate size, occasionally reaching 5â15 m in height, with spiny shoots and evergreen leaves. The flowers are solitary or in small groups and are often very strongly scented. Fruit are produced between late fall and early spring, depending on the area. They grow well in well-drained loamy soils with slightly acidic pH, no-frost areas and good quality of irrigation water. Varieties are characterized by the timing of bloom and fruit set as well as the susceptibility to cold temperatures.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "CITRUS",
        "Id": "5a6085b590254820b35d28ea",
        "Importance": "1",
        "Introduction": "Citrus are a genus of flowering trees and shrubs in the Rutaceae family, native to subtropical and tropical regions of south-East Asia. Today, some species are economically important in the Mediterranean basin, India subcontinent as well as in the south of the USA, where they find optimal soil and climatic conditions. Oranges, lemons, grapefruit, grapefruit and lime are fruit of citrus trees.",
        "K_From": "6",
        "K_Opt": "6",
        "K_To": "6",
        "K_Unit": "kg/10 trees",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "6",
        "N_Opt": "6",
        "N_To": "6",
        "N_Unit": "kg/10 trees",
        "Name": "Citrus",
        "P_From": "3",
        "P_Opt": "3",
        "P_To": "3",
        "P_Unit": "kg/10 trees",
        "Ph_From": "5.5",
        "Ph_Opt": "6.5",
        "Ph_To": "7.5",
        "Picture": "transplanted-citrus-1583331151.jpg",
        "Plant_Height_From": "500",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "1500",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "1250",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1850",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "low",
        "Scientific_Name": "Rutaceae",
        "Seed_Depth_From": "50",
        "Seed_Depth_To": "100",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Citrus trees require between 60 cm and 1 meter of well-drained topsoil to grow optimally. Loams and sandy loams are preferred, a complement of humus is optimal. In the case of very sandy soils with low water-retention capacity, there is a risk of nutrient leaching. Clay soils can cause collar and root rot and the risk of tree death. Optimal pH is between 6.0 and 6.5 and pH above 8 should be avoided. Slopes of up to 15% are suitable if soil erosion and excessive drainage are avoided. Windbreaks are recommended",
        "Soil_Type": "loamy",
        "Spacing_From": "350",
        "Spacing_Opt": "600",
        "Spacing_To": "750.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "13",
        "Temp_Day_Growth_Opt": "28",
        "Temp_Day_Growth_To": "37",
        "Temp_Soil_Germ_From": "0",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "0",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Apple": {
        "Care": "Apples can be cultivated with several different methods: grafting, budding, or on rootstocks. When planting, trees should be spaced in such a way to ensure sufficient pollinators; ideally there should be one pollinator tree for every 2-3 large trees. Apples are sensitive to low moisture, so regular rainfall is best for growth. Regular pruning is crucial for plant vitality and productivity. Thinning fruits (to about one fruit per 40 leaves) is also important for optimal fruit size and quality.",
        "Climate": "Apple is a temperate crop that thrives in temperatures between 21 and 24C. They can also be grown in higher altitudes (1500-2700m above sea level). Rainfall that is evenly distributed throughout the growing season is best for apple growth. Windy conditions are harmful to apple trees. Dry, sunny conditions help to produce fruits that have high sugar content and a longer shelf life.",
        "Crop_Cycle_Length_Max": "365",
        "Crop_Cycle_Length_Min": "1",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Apple fruits are grown from deciduous trees, which can grow to a height of 2-5m. The size of the tree is dictated by the type of rootstock that is selected. Apple fruits&s; skin color ranges can range from red to green and can exhibit multiple colors. The inner flesh ranges from white to yellow in color.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "APPLE",
        "Id": "5cf79e943bd1b65e77a9b2d4",
        "Importance": "1",
        "Introduction": "Apple is a temperate fruit that is primarily consumed fresh, with a small percentage of production being used for canned and other processed products. Apple is the fourth-most produced fruit globally.",
        "K_From": "4",
        "K_Opt": "4",
        "K_To": "4",
        "K_Unit": "kg/10 trees",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "4",
        "N_Opt": "4",
        "N_To": "4",
        "N_Unit": "kg/10 trees",
        "Name": "Apple",
        "P_From": "2",
        "P_Opt": "2",
        "P_To": "2",
        "P_Unit": "kg/10 trees",
        "Ph_From": "5.5",
        "Ph_Opt": "0",
        "Ph_To": "6.5",
        "Picture": "transplanted-apple-1583329809.jpg",
        "Plant_Height_From": "200",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "500",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "1000",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1250",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Malus pumila",
        "Seed_Depth_From": "60",
        "Seed_Depth_To": "100",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Loamy, well-drained soils with a pH of 5.5-6.5 are best for apple propagation. Soils should not be water-logged or have compacted subsoil. Mulch mixed with organic material can help to retain soil moisture.",
        "Soil_Type": "loamy",
        "Spacing_From": "500",
        "Spacing_Opt": "0",
        "Spacing_To": "900.0",
        "Storage": "",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "23",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "21",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "24",
        "Temp_Soil_Germ_From": "15",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "23",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Pepper": {
        "Care": "Drainage is important and depending on soil type, raised beds may be necessary. The soil can be prepared in autumn by deep ploughing. Capsicum is generally grown as seedling and is then planted out when the risk of frost has passed. Seedlings from reputable nurseries are preferred to obtain plants that are well grown and free from diseases. Grow windbreak plants like ryecorn or sweetcorn in rows where there is a danger of wind damage. Application of fowl manure or compost, at least four weeks before planting, is recommended.",
        "Climate": "Ideal growing conditions for peppers include a sunny position with warm loamy soil,  ideally 21 to 29 °C, that is moist but not waterlogged. Extremely moist soils can cause seedlings to \"damp-off\" and reduce germination. The plants will tolerate (but not prefer) temperatures down to 12 °C and are sensitive to frost. Capsicum flowering is tightly connected to the length of daytime. The flowers can self-pollinate. However, at extremely high temperature (33 to 38 °C), pollen loses viability, and flowers are much less likely to pollinate successfully.",
        "Crop_Cycle_Length_Max": "150",
        "Crop_Cycle_Length_Min": "90",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Pepper, also known as Capiscum, is a flowering plant of the nightshade family Solanaceae. The plant is sensitive to cold temperatures, resulting in reduced growth in colder climates. A long frost-free growing season with high temperatures is desirable. The fruits can vary widely in color, shape, and size between species.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "PEPPER",
        "Id": "5a6ae99f902548430e9c441a",
        "Importance": "1",
        "Introduction": "Pepper or Capiscum is a flowering plant of the nightshade family. It originates in the Americas (remains from its cultivation found in Mexico in 3,000 BC) and has been introduced to the rest of the world after the 16th century. 50% of all peppers today are grown in China, followed by Mexico, Turkey, Indonesia and Spain.",
        "K_From": "45",
        "K_Opt": "50",
        "K_To": "55",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "105",
        "N_Opt": "120",
        "N_To": "135",
        "N_Unit": "kg/ha",
        "Name": "Pepper",
        "P_From": "55",
        "P_Opt": "60",
        "P_To": "65",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6.5",
        "Ph_To": "7",
        "Picture": "transplanted-pepper-1583330977.jpg",
        "Plant_Height_From": "0",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "0",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "700",
        "Rainfall_Opt": "0",
        "Rainfall_To": "2000",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Capsicum",
        "Seed_Depth_From": "1",
        "Seed_Depth_To": "2",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Capsicums can be cultivated in many types of soil but grow best on deep, loamy and well-drained soils. Soil pH should be in the range of 5.5 â 7.0. They can develop strong deep tap roots (&g; 1 m). Uniform slopes are desirable, as they facilitate drainage, but not essential. Depressions in the field can result in flooding.",
        "Soil_Type": "loamy",
        "Spacing_From": "75",
        "Spacing_Opt": "0",
        "Spacing_To": "90.0",
        "Storage": "",
        "Temp_Air_Germ_From": "21",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "29",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "12",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "38",
        "Temp_Soil_Germ_From": "12",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Chickpea": {
        "Care": "Initial soil fertility will dictate quantities of additional fertilizer needed. Chickpeas grow well in dry soil and require little water, so they can be grown as a rainfed crop. In case rainfall is not sufficient, irrigation should occur prior to flower and during pod development. To minimize weed growth in your field, consider mulching with organic matter such as dry leaves.",
        "Climate": "The chickpea plants grow very well under good moisture conditions. And the ideal temperatures for growing chickpea is between 24ºC and 30ºC. Although the plants can survive as low as 15 ºC and as high 35 ºC temperature. Annual rainfall of about 650 to 950 mm is ideal.",
        "Crop_Cycle_Length_Max": "150",
        "Crop_Cycle_Length_Min": "140",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "The chickpea is a tender annual legume, a bushy plant that grows to about 45cm tall and has pairs of dark green, compound leaflets that look like vetch. Chick peas have swollen, oblong pods to about 2.5cm long and nearly as wide that contain one or two large, cream-colored, pea-like seeds each. Flowers may be white or violet colored depending on the variety.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "CHICKPEA",
        "Id": "5ba07e20902548262706d1cb",
        "Importance": "1",
        "Introduction": "India is the global leader in chickpea production and acreage. The chickpea is one of the oldest pulse cash crops and has been cultivated in India since ancient times. It is a complete protein source and also offers fiber and other essential vitamins. The chickpea can be made into split pulse (known as Chana Dal), and flour (Besan). Fresh green leaves are used as vegetable while straw of chickpea is an excellent fodder for cattle.",
        "K_From": "20",
        "K_Opt": "20",
        "K_To": "20",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "25",
        "N_Opt": "25",
        "N_To": "25",
        "N_Unit": "kg/ha",
        "Name": "Chickpea",
        "P_From": "50",
        "P_Opt": "50",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6.3",
        "Ph_To": "7",
        "Picture": "direct_seeding-chickpea-1583329941.jpg",
        "Plant_Height_From": "40",
        "Plant_Height_Opt": "45",
        "Plant_Height_To": "50",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "650",
        "Rainfall_Opt": "775",
        "Rainfall_To": "900",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Cicer arietinum",
        "Seed_Depth_From": "10",
        "Seed_Depth_To": "12",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "15",
        "Seed_Rate_Opt": "16",
        "Seed_Rate_To": "18",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Chickpea plants can be grown on a wide variety of soils, but sandy loam to slightly clay soil is ideal. Soil should be well-drained because water logging is not suitable for chickpea cultivation. pH level ranging between 5.5 and 7.0 is ideal for growing chickpea. Chickpeas require rough seed bed, and they donât do well in very fine and compact seedbed.",
        "Soil_Type": "loamy",
        "Spacing_From": "9",
        "Spacing_Opt": "10",
        "Spacing_To": "11.0",
        "Storage": "",
        "Temp_Air_Germ_From": "18",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "29",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "24",
        "Temp_Day_Growth_Opt": "27",
        "Temp_Day_Growth_To": "30",
        "Temp_Soil_Germ_From": "24",
        "Temp_Soil_Germ_Opt": "26",
        "Temp_Soil_Germ_To": "28",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "low"
    },
    "Peanut": {
        "Care": "Proper land preparation and care is important for successful peanut production. The first tillage should take place 3-6 weeks before planting and should occur at a depth of 20-30 cm in the soil. Make sure to obtain high-quality seeds for sowing. Before sowing apply a rhizobium inoculum to encourage rhizobium development and nitrogen fixation. Depending on the type of peanut (Bunchy or Spreading) there should be a 10-15cm distance between plants and a 60 cm distance between rows.",
        "Climate": "Warm and moist climatic conditions with full sun are favorable for maximizing peanut production. The average optimal daily temperature is around 30 degrees celsius with a minimum 100-day ideal temperature growing season being required for successful peanut production. Temperature is the greatest limiting factor in peanut production, while peanuts can tolerate cool and wet climates, these conditions will favor crop disease.( LONG DAYS PROMOTE VEGETATIVE GROWTH AT THE EXPENSE OF REPRODUCTIVE GROWTH RATE, DECREASED  PODS , DECREASED DURATION OF POD FILLING AND ULTIMATELY DECREASED YIELD )",
        "Crop_Cycle_Length_Max": "150",
        "Crop_Cycle_Length_Min": "120",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Peanuts are an annual herbaceous plant in the Fabaceae family also known as the bean or pea family. Peanut grows on average 30 to 50 cm (1.0 to 1.6 ft) tall. Peanuts are a legume and therefore contain nitrogen-fixing bacteria in their root nodules. Due to their nitrogen-fixing nature peanuts can be useful in crop rotation cycles. The edible part of the peanut plant is the fruit which develops and matures underground.",
        "Exposition": "full sun",
        "Fertilization": "low",
        "Host_Id": "PEANUT",
        "Id": "5a7ab8f490254844b20c2c9b",
        "Importance": "1",
        "Introduction": "The peanut plant is a legume of the Fabaceae family, widely grown in the tropics and subtropics. Peanuts a grain legume grown for their nutritional use and also are classified as an \"oil crop\" due to their high oil and fat contents. Peanuts originated in South America but are now cultivated worldwide. Peanuts are grown in over 20 countries on approximately 42 million acres, with China producing the most at roughly 37% of global production.",
        "K_From": "50",
        "K_Opt": "50",
        "K_To": "50",
        "K_Unit": "kg/ha",
        "Labor": "high",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "25",
        "N_Opt": "25",
        "N_To": "25",
        "N_Unit": "kg/ha",
        "Name": "Peanut",
        "P_From": "50",
        "P_Opt": "50",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "6",
        "Ph_To": "7",
        "Picture": "direct_seeding-peanut-1562752367.jpg",
        "Plant_Height_From": "40",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "60",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "750",
        "Rainfall_Opt": "0",
        "Rainfall_To": "1250",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Arachis hypogaea",
        "Seed_Depth_From": "5",
        "Seed_Depth_To": "10",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "75",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "80",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Peanuts grow best in well-drained, loose textured soils, such as light, sandy loam soils. While peanuts can grow in varying soil conditions these are not favorable due to the chance of excessive water retention. The peanut forming pegs have difficulty penetrating through denser soils such as clay soils. The soil should be aerated and contain moderate amounts of organic matter.  Peanuts thrive in slightly acidic soils but will grow in any soil with a pH of 5.9-7.( 5.5 TO 7.0 )",
        "Soil_Type": "loamy",
        "Spacing_From": "10",
        "Spacing_Opt": "0",
        "Spacing_To": "15.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "15",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "45",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "22",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "27",
        "Temp_Soil_Germ_From": "18",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "25",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Pomegranate": {
        "Care": "Prior to planting, thorough plowing and removal of debris is recommended to bring the soil to fine texture and allow proper aeration in the soil. Air-layering is the dominant form of propagation. Multi-stem training is recommended for pomegranate training to avoid the spread of disease. Drip irrigation is best for pomegranate cultivation, delivering optimally 20cm per year. Fruits are ready for harvest about 120-130 days after the fruiting stage begins. Pomegranates can be intercropped with pulses and vegetables.",
        "Climate": "Pomegranate can grow in both temperate, semi-arid, and sub-tropical areas. It generally favors a sunny, warm, dry climate for optimal growth, especially during fruiting. It also needs cold and dry weather during the winter.",
        "Crop_Cycle_Length_Max": "365",
        "Crop_Cycle_Length_Min": "1",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Pomegranate has cultivars that are both deciduous and evergreen. It has narrow leaves and spiny branches. The trees can grow to a height of 6 to 10 meters. It produces red fruits with hard skin on the outside and soft skin (mesocarp) on the inside, to which the edible juicy seeds are attached.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "POMEGRANATE",
        "Id": "5cf7bb093bd1b662883b19b4",
        "Importance": "1",
        "Introduction": "Pomegranate (Punica granatum) is a commercially-important fruit that can be consumed fresh or processed into juice and jam. Pomegranate trees take 3 years to begin fruiting, but can then produce fruit for up to 30 years.",
        "K_From": "1",
        "K_Opt": "1",
        "K_To": "1",
        "K_Unit": "kg/10 trees",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "",
        "N_From": "5",
        "N_Opt": "5",
        "N_To": "5",
        "N_Unit": "kg/10 trees",
        "Name": "Pomegranate",
        "P_From": "1",
        "P_Opt": "1",
        "P_To": "1",
        "P_Unit": "kg/10 trees",
        "Ph_From": "6.5",
        "Ph_Opt": "0",
        "Ph_To": "7.5",
        "Picture": "transplanted-pomegranate-1583331360.jpg",
        "Plant_Height_From": "600",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "1000",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "20",
        "Rainfall_Opt": "0",
        "Rainfall_To": "20",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "plough",
        "Scientific_Name": "Punica granatum",
        "Seed_Depth_From": "60",
        "Seed_Depth_To": "100",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "0",
        "Seed_Rate_Opt": "0",
        "Seed_Rate_To": "0",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Pomegranate is tolerant of a wide range of soil types, but prefers heavy loamy soils that are deep and drain well. Excessive soil moisture can lower yield and fruit quality.",
        "Soil_Type": "loamy",
        "Spacing_From": "250",
        "Spacing_Opt": "0",
        "Spacing_To": "500.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "35",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "38",
        "Temp_Soil_Germ_From": "0",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "0",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "low"
    },
    "Melon": {
        "Care": "Unlike most other crops, flowers on watermelon plants cannot develop into fruits on their own. The specialty of this plant is that male and female flowers are produced separately on the same plant. The male flowers are smaller in size and appear first while female flowers are huge and appear later. The female flowers have a small fruit at the base. In case it shrivels, it means there would be no pollination. In nature, bees carry the pollen while hopping from flower to flower gathering nectar. Therefore, setting up an artificial beehive in the watermelon field is a good idea.",
        "Climate": "Being a warm season crop, the plant requires ample sunshine and dry weather for production of fruits. In India, since the climate is mostly tropical, all seasons are suitable for watermelon cultivation. However, watermelon is sensitive to cold and frost. Therefore, in parts of the country where winter is severe, watermelons are cultivated after the frost has passed. 24-27â°C is ideal for the seed germination and growth of watermelon plants.",
        "Crop_Cycle_Length_Max": "100",
        "Crop_Cycle_Length_Min": "70",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "It is a sweet, edible fruit that has a green rind on the outside and edible red-colored flesh with black-colored seeds on the inside. The color of the flesh varies from pink to red. The fruit varies in shape from oblong to spherical. The melons grow on a vine that can reach a length of 3 meters. The vines are covered with tiny hairs; they are thin and have grooves in them. The flowers are yellow-colored.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "MELON",
        "Id": "5cf7bff03bd1b662883b19cc",
        "Importance": "1",
        "Introduction": "Watermelon originates from South Africa. It is a desert fruit that contains 92% water along with proteins, minerals and carbohydrates. Watermelons are mainly cultivated in Maharashtra, Karnataka, Tamil Nadu, Punjab, Rajasthan, Madhya Pradesh, and Uttar Pradesh.",
        "K_From": "50",
        "K_Opt": "50",
        "K_To": "50",
        "K_Unit": "kg/ha",
        "Labor": "intermediate",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "100",
        "N_Opt": "100",
        "N_To": "100",
        "N_Unit": "kg/ha",
        "Name": "Watermelon",
        "P_From": "50",
        "P_Opt": "50",
        "P_To": "50",
        "P_Unit": "kg/ha",
        "Ph_From": "6",
        "Ph_Opt": "6.8",
        "Ph_To": "7.5",
        "Picture": "direct_seeding-melon-1583331267.jpg",
        "Plant_Height_From": "0",
        "Plant_Height_Opt": "0",
        "Plant_Height_To": "0",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "50",
        "Rainfall_Opt": "62",
        "Rainfall_To": "75",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Citrullus lanatus",
        "Seed_Depth_From": "2",
        "Seed_Depth_To": "3",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "3",
        "Seed_Rate_Opt": "3",
        "Seed_Rate_To": "4",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Watermelon grows well in deep fertile and well-drained soil. It gives best results when grown on sandy or sandy loam soil. Water must easily drain off from the soil else the vines are likely to develop fungal infections. Follow crop rotation as continuous growing of same crop on same field leads loss of nutrients, poor yield and more disease attack. The pH of the soil must be between 6.0 and 7.5. Acidic soil would result in withering away of the seeds. While soil with a neutral pH is preferred, it can also grow well even if the soil is slightly alkaline.",
        "Soil_Type": "loamy",
        "Spacing_From": "30",
        "Spacing_Opt": "60",
        "Spacing_To": "90.0",
        "Storage": "",
        "Temp_Air_Germ_From": "0",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "0",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "25",
        "Temp_Day_Growth_To": "30",
        "Temp_Soil_Germ_From": "24",
        "Temp_Soil_Germ_Opt": "25",
        "Temp_Soil_Germ_To": "27",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "intermediate"
    },
    "Rice": {
        "Care": "Plains or gentle slopes are most suitable for the production of rice. The traditional method for cultivating rice is flooding the fields while, or after, planting the young seedlings. This simple method requires sound planning and servicing of the water damming and channeling, but reduces the growth of less robust weed and pest plants that have no submerged growth state, and deters vermin. While flooding is not mandatory for the cultivation of rice, all other methods of irrigation require higher effort in weed and pest control during growth periods and a different approach for fertilizing the soil.",
        "Climate": "Temperature between 16°C â 27°C and rainfall 100 cm to 200 cm are ideal for rice growth. However, rainfall during harvest times is harmful. An annual coverage temperature around 24°C is ideal. To germinate, rice seeds need to absorb a certain amount of water to break the dormancy stage of the seed.",
        "Crop_Cycle_Length_Max": "120",
        "Crop_Cycle_Length_Min": "90",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "transplanted",
        "Description": "Although its parent species are native to Asia and certain parts of Africa, centuries of trade have made rice popular in many cultures worldwide. Growing rice is labor intensive and requires a lot of water. However, the crop can be grown practically anywhere, even on a steep hill or mountain area with the use of water-controlling terrace systems.",
        "Exposition": "full sun",
        "Fertilization": "intermediate",
        "Host_Id": "RICE",
        "Id": "5a57706964f7fe04b82c053d",
        "Importance": "1",
        "Introduction": "Rice is mostly grown as an annual crop. It is a labour-intensive and requires large amounts of water. Temperatures between 16-27°C are ideal. Seeding to harvest will take between 90 to 120 (or more) days.",
        "K_From": "32",
        "K_Opt": "35",
        "K_To": "37",
        "K_Unit": "kg/ha",
        "Labor": "high",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "73",
        "N_Opt": "75",
        "N_To": "77",
        "N_Unit": "kg/ha",
        "Name": "Rice Transplanted",
        "P_From": "23",
        "P_Opt": "25",
        "P_To": "27",
        "P_Unit": "kg/ha",
        "Ph_From": "5.5",
        "Ph_Opt": "7",
        "Ph_To": "8.5",
        "Picture": "maxresdefault.jpg",
        "Plant_Height_From": "50",
        "Plant_Height_Opt": "101",
        "Plant_Height_To": "160",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "5",
        "Plant_Width_Opt": "101",
        "Plant_Width_To": "10",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "115",
        "Rainfall_Opt": "101",
        "Rainfall_To": "300",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "tractor",
        "Scientific_Name": "Oryza sativa",
        "Seed_Depth_From": "0.5",
        "Seed_Depth_To": "1",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "60",
        "Seed_Rate_Opt": "70",
        "Seed_Rate_To": "80",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Rice is growing best on alluvial soil and fertile river basins. However, this crop is versatile and can also be grown on mixed soil or loamy and clayey soil as long as enough water and fertilizer are available.",
        "Soil_Type": "sandy",
        "Spacing_From": "10",
        "Spacing_Opt": "15",
        "Spacing_To": "25.0",
        "Storage": "easy",
        "Temp_Air_Germ_From": "10",
        "Temp_Air_Germ_Opt": "101",
        "Temp_Air_Germ_To": "40",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "20",
        "Temp_Day_Growth_Opt": "30",
        "Temp_Day_Growth_To": "35",
        "Temp_Soil_Germ_From": "5",
        "Temp_Soil_Germ_Opt": "101",
        "Temp_Soil_Germ_To": "6",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "high"
    },
    "Pigeonpea": {
        "Care": "Pigeon pea is cultivated from seed. It is frequently inter cropped with sorghum, groundnuts, sesame, cotton, millet, or maize. Pigeon pea shows little response to nitrogen fertilizer. Flowering can occur as early as 100 to as late as 430 days, depending on location and sowing date. Pigeon peas do not generally need much fertilization, however it responds well to sulfur on soils that lack this element.",
        "Climate": "Pigeon pea is drought-resistant and can grow in areas with less than 650mm of annual rainfall.  It grows best at between temperatures of 18 and 29 °C. It is sensitive to water logging and frost. The soil temperature can influence the germination of pigeon pea. If sown directly into the ground, pigeon peas will germinate at soil temperature of 60°F within two weeks.",
        "Crop_Cycle_Length_Max": "155",
        "Crop_Cycle_Length_Min": "115",
        "Crop_Rotation": "[]",
        "Cultivation_Type": "direct_seeding",
        "Description": "Pigeon pea is a perennial woody shrub that is mostly grown as an annual for the legume. It can grow up to 4m tall with a deep an extensive root system up to 2m deep. Flowers are multi-colored in yellow, orange, and red. The vegetative growth of pigeon pea begins slowly but becomes increased when the plants is up to two or three months",
        "Exposition": "full sun",
        "Fertilization": "low",
        "Host_Id": "PIGEONPEA",
        "Id": "5cf7b6a23bd1b662883b199f",
        "Importance": "1",
        "Introduction": "Pigeonpea has been cultivated for thousands of years and serves as a major source of protein. It is frequently intercopped with cereals or other legumes. It is commonly cultivated on marginal land due to its low demand for fertilizer, irrigation, and pesticides. This, along with its drought-resistance, makes it a good alternative to crops that fail more frequently, such as maize.",
        "K_From": "30",
        "K_Opt": "30",
        "K_To": "30",
        "K_Unit": "kg/ha",
        "Labor": "low",
        "Language": "en",
        "Lifecycle": "annual",
        "N_From": "30",
        "N_Opt": "30",
        "N_To": "30",
        "N_Unit": "kg/ha",
        "Name": "Pigeonpea",
        "P_From": "60",
        "P_Opt": "60",
        "P_To": "60",
        "P_Unit": "kg/ha",
        "Ph_From": "5",
        "Ph_Opt": "0",
        "Ph_To": "8.5",
        "Picture": "direct_seeding-pigeonpea-1583329729.jpg",
        "Plant_Height_From": "100",
        "Plant_Height_Opt": "200",
        "Plant_Height_To": "400",
        "Plant_Height_Unit": "cm",
        "Plant_Width_From": "0",
        "Plant_Width_Opt": "0",
        "Plant_Width_To": "0",
        "Plant_Width_Unit": "cm",
        "Rainfall_From": "0",
        "Rainfall_Opt": "0",
        "Rainfall_To": "650",
        "Rainfall_Unit": "mm",
        "Required_Mechanization": "",
        "Scientific_Name": "Cajanus cajan",
        "Seed_Depth_From": "4",
        "Seed_Depth_To": "5",
        "Seed_Depth_Unit": "cm",
        "Seed_Rate_From": "15",
        "Seed_Rate_Opt": "20",
        "Seed_Rate_To": "25",
        "Seed_Rate_Unit": "kg/ha",
        "Soil_Description": "Pigeon pea plants are adapted to a broad range of soil conditions and types. They however prefer well-drained, medium-heavy, loamy soils and do not tolerate waterlogged ground. .",
        "Soil_Type": "loamy",
        "Spacing_From": "10",
        "Spacing_Opt": "15",
        "Spacing_To": "20.0",
        "Storage": "",
        "Temp_Air_Germ_From": "22",
        "Temp_Air_Germ_Opt": "0",
        "Temp_Air_Germ_To": "30",
        "Temp_Air_Germ_Unit": "C",
        "Temp_Day_Growth_From": "22",
        "Temp_Day_Growth_Opt": "0",
        "Temp_Day_Growth_To": "30",
        "Temp_Soil_Germ_From": "25",
        "Temp_Soil_Germ_Opt": "0",
        "Temp_Soil_Germ_To": "35",
        "Temp_Soil_Germ_Unit": "C",
        "Translated": "True",
        "Watering": "low"
    }
}